# m = '''1. Введение в Python
# 2. Строки и списки
# 3. Условные операторы
# 4. Циклы
# 5. Словари, кортежи и множества
# 6. Выход'''
# x = int(input())
# if x == 1:
#     print('1. Введение в Python')
# elif x == 2:
#     print('2. Строки и списки')
# elif x == 3:
#     print('3. Условные операторы')
# elif x == 4:
#     print('4. Циклы')
# elif x == 5:
#     print('5. Словари, кортежи и множества')
# else:
#     print("6. Выход'''")

n = int(input())
m = '''1. Введение в Python
2. Строки и списки
3. Условные операторы
4. Циклы
5. Словари, кортежи и множества
6. Выход'''
r = m.split('\n')
if n == 1:
    print(r[n-1])
elif n == 2:
    print(r[n-1])
elif n == 3:
    print(r[n-1])
elif n == 4:
    print(r[n-1])
elif n == 5:
    print(r[n-1])
elif n == 6:
    print(r[n-1])